Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: These are the types to which the function call operation (see section :ref:`calls`) can be applied:
ru: Это типы, к которым применима операция вызова (исполнения) функции (смотрите раздел "Вызовы" :ref:`calls` ) :

source: A user-defined function object is created by a function definition (see section :ref:`function`). It should be called with an argument list containing the same number of items as the function's formal parameter list.
ru: Объект функции определяемой пользователем создаётся определением функции (смотрите раздел “Определения функций” :ref:`function` ). Её следует вызывать со списком, содержащим ровно то же количество аргументов, что и в списке формальных параметров этой функции.

source: Special attributes:
ru: Специальные атрибуты :

source: Attribute
ru: Атрибут

source: Meaning
ru: Смысл

source: The function's documentation string, or ``None`` if unavailable
ru: Строка описания (“документации”) данной функции, или иначе значение :const:`None` .

source: Writable
ru: Изменяемый

source: The function's name
ru: Имя данной функции.

source: The name of the module the function was defined in, or ``None`` if unavailable.
ru: Имя модуля, в котором данная функция была определена, или иначе значение :const:`None` .

source: A tuple containing default argument values for those arguments that have defaults, or ``None`` if no arguments have a default value
ru: Кортеж, содержащий значения по умолчанию для аргументов, для которых они определены, или значение :const:`None` , если нет аргументов со значением по умолчанию.

source: The code object representing the compiled function body.
ru: Объект кода, представляющий компилированное тело данной функции.

source: A reference to the dictionary that holds the function's global variables --- the global namespace of the module in which the function was defined.
ru: Ссылка на словарь, содержащий глобальные переменные данной функции — глобальная область имён того модуля, в котором данная функция была определена.

source: Read-only
ru: Неизменяемый

source: The namespace supporting arbitrary function attributes.
ru: Пространство имён для поддержки произвольных атрибутов данной функции.

source: ``None`` or a tuple of cells that contain bindings for the function's free variables.
ru: «:const:`None`» или кортеж ячеек, содержащих назначения для тех переменных данной функции, которые более нигде не связаны (тоесть, “замыкание”) .

source: A dict containing annotations of parameters. The keys of the dict are the parameter names, or ``'return'`` for the return annotation, if provided.
ru: Словарь, содержащий описания параметров. Ключи этого словаря совпадают с именами параметров к этой функции, также может присутствовать ключ «``'return'``» для соответствующего описания .

source: A dict containing defaults for keyword-only parameters.
ru: Словарь, содержащий значения по умолчанию для параметров, доступных только по имени.

source: Most of the attributes labelled "Writable" check the type of the assigned value.
ru: Большинство атрибутов помеченных “Изменяемый” проверяют тип записываемого в них значения.

source: Function objects also support getting and setting arbitrary attributes, which can be used, for example, to attach metadata to functions. Regular attribute dot-notation is used to get and set such attributes. *Note that the current implementation only supports function attributes on user-defined functions. Function attributes on built-in functions may be supported in the future.*
ru: Объекты-функции также поддерживают получение и установку произвольных атрибутов, которые могут быть использованы, например, для прикрепления метаданных к функциям. Для получения и установки таких атрибутов используется стандартная запись атрибутов через точку. Обратите внимание, что текущая реализация поддерживает только атрибуты пользовательских функций. Атрибуты встроенных функций могут быть реализованы в будущем.

source: Additional information about a function's definition can be retrieved from its code object; see the description of internal types below.
ru: Дополнительная информация об определении функции может быть получена из ее объекта-кода; смотрите описание встроенных типов ниже.

source: An instance method object combines a class, a class instance and any callable object (normally a user-defined function).
ru: Объект метода экземпляра сочетает в себе класс, экземпляр класса и любой вызываемый объект (обычно - функция, определяемая пользователем) .

source: Special read-only attributes: :attr:`__self__` is the class instance object, :attr:`__func__` is the function object; :attr:`__doc__` is the method's documentation (same as ``__func__.__doc__``); :attr:`__name__` is the method name (same as ``__func__.__name__``); :attr:`__module__` is the name of the module the method was defined in, or ``None`` if unavailable.
ru: Специальные атрибуты, доступные только для чтения : «:attr:`__self__`» это данный объект экземпляра класса, «:attr:`__func__`» это данный объект функции; «:attr:`__doc__`» это описание данного метода (то же, что и «``__func__.__doc__``»); «:attr:`__name__`» это имя данного метода (то же, что и «``__func__.__name__``»); «:attr:`__module__`» это имя того модуля, в котором данный метод был определен, или, если не применимо - «:const:`None`» .

source: Methods also support accessing (but not setting) the arbitrary function attributes on the underlying function object.
ru: Методы также поддерживают доступ (но не запись) к произвольному атрибуту функции в объекте соответствующей функции.

source: When an instance method object is derived from a class method object, the "class instance" stored in :attr:`__self__` will actually be the class itself, so that calling either ``x.f(1)`` or ``C.f(1)`` is equivalent to calling ``f(C,1)`` where ``f`` is the underlying function.
ru: Если метод экземпляра не определён в этом экземпляре, а унаследован от метода класса, то атрибут «:attr:`__self__`» на самом деле будет указывать не на этот экземпляр класса, а непосредственно на сам класс, и, таким образом, вызов и «``x.f(1)``» и «``C.f(1)``» является эквивалентом вызову «``f(C,1)``» , где «``f``» - соответствующая функция.

source: Note that the transformation from function object to instance method object happens each time the attribute is retrieved from the instance. In some cases, a fruitful optimization is to assign the attribute to a local variable and call that local variable. Also notice that this transformation only happens for user-defined functions; other callable objects (and all non-callable objects) are retrieved without transformation. It is also important to note that user-defined functions which are attributes of a class instance are not converted to bound methods; this *only* happens when the function is an attribute of the class.
ru: Заметьте, что преобразование из объекта функции в объект метода экземпляра происходит каждый раз при извлечении атрибута из экземпляра. В некоторых случаях эффективной оптимизацией является назначение атрибута локальной переменной и вызов этой локальной переменной. Также учитывайте, что это преобразование выполняется только для функций, определенных пользователем; прочие вызываемые объекты (и все невызываемые объекты) извлекаются без преобразования. Важно заметить, что такие определенные пользователем функции, которые являются атрибутами экземпляров классов, не преобразуются в связанные методы; это происходит **только** если функция является атрибутом класса.

source: A function or method which uses the :keyword:`yield` statement (see section :ref:`yield`) is called a :dfn:`generator function`. Such a function, when called, always returns an iterator object which can be used to execute the body of the function: calling the iterator's :meth:`__next__` method will cause the function to execute until it provides a value using the :keyword:`yield` statement. When the function executes a :keyword:`return` statement or falls off the end, a :exc:`StopIteration` exception is raised and the iterator will have reached the end of the set of values to be returned.
ru: Функция или метод, задействующие инструкцию «:keyword:`yield`» (смотрите раздел “Инструкция «yield»” :ref:`yield` ) , называется : функция-генератор (:dfn:`generator function`) . При вызове такая функция всегда возвращает объект-итератор, который может быть использован для выполнения тела функции – вызов метода «:meth:`__next__`» данного итератора приведёт к исполнению данной функции, пока она предоставляет какое-либо значение с использованием инструкции «:keyword:`yield`» . Когда данная функция исполняет инструкцию «:keyword:`return`» или достигает своего конца – вызывается исключение «:exc:`StopIteration`» – и объект-итератор таким образом достигнет конца множества значений, которые он должен выдать.

source: A built-in function object is a wrapper around a C function. Examples of built-in functions are :func:`len` and :func:`math.sin` (:mod:`math` is a standard built-in module). The number and type of the arguments are determined by the C function. Special read-only attributes: :attr:`__doc__` is the function's documentation string, or ``None`` if unavailable; :attr:`__name__` is the function's name; :attr:`__self__` is set to ``None`` (but see the next item); :attr:`__module__` is the name of the module the function was defined in or ``None`` if unavailable.
ru: Объект - встроенная функция – это посредник к функции на “C” . Примерами встроенных функций являются : «:func:`len`» и «:func:`math.sin`» ( «:mod:`math`» – стандартный встроенный модуль) . Количество и тип её аргументов определяется соответствующей функцией на “C” . Особые доступные только для чтения атрибуты : «:attr:`__doc__`» – текст документации данной функции или иначе «:const:`None`» ; «:attr:`__name__`» – имя данной функции; «attr:`__self__`» – установлен в «:const:`None`» (но далее смотрите об этом подробнее) ; «:attr:`__module__`» – имя модуля, в котором определена данная функция или иначе «:const:`None`» .

source: This is really a different disguise of a built-in function, this time containing an object passed to the C function as an implicit extra argument. An example of a built-in method is ``alist.append()``, assuming *alist* is a list object. In this case, the special read-only attribute :attr:`__self__` is set to the object denoted by *list*.
ru: Это, по сути, другое обличие встроенных функций, которые в этом случае имеют дополнительный аргумент, передаваемый в функцию на “C” неявно. Примером встроенного метода является «``alist.append()``» , где *alist* – это объект-список. В таком случае особый предназначенный только для чтения атрибут «:attr:`__self__`» содержит указание на этот объект *alist* .

source: Classes are callable. These objects normally act as factories for new instances of themselves, but variations are possible for class types that override :meth:`__new__`. The arguments of the call are passed to :meth:`__new__` and, in the typical case, to :meth:`__init__` to initialize the new instance.
ru: Классы являются вызываемыми (исполняемыми) объектами. Как правило, они работают как фабрики для новых собственных экземпляров класса, при этом генерация может проходить с вариациями у таких типов классов, в которых переопределён метод «:meth:`__new__`» . Аргументы вызова передаются методу «:meth:`__new__`» и, как правило, методу «:meth:`__init__`» для инициализации нового экземпляра.

source: Instances of arbitrary classes can be made callable by defining a :meth:`__call__` method in their class.
ru: Экземпляры любого класса могут быть сделаны вызываемыми (исполнимыми) посредством определения метода «:meth:`__call__`» в их классе.

source: Modules are imported by the :keyword:`import` statement (see section :ref:`import`). A module object has a namespace implemented by a dictionary object (this is the dictionary referenced by the __globals__ attribute of functions defined in the module). Attribute references are translated to lookups in this dictionary, e.g., ``m.x`` is equivalent to ``m.__dict__["x"]``. A module object does not contain the code object used to initialize the module (since it isn't needed once the initialization is done).
ru: Модули импортируются с помощью инструкции :keyword:`import` (смотрите раздел : “Инструкция «import»” :ref:`import` ). Объект модуль имеет область имён реализованую в виде объекта словарь в атрибуте «:attr:`__dict__`» (это тот самый словарь, на который ссылается атрибут «:attr:`__globals__`» функций определеных в этом модуле). Упоминания атрибутов преобразуются в поиск в этом словаре, например, «``m.x``» эквивалентно «``m.__dict__["x"]``» . Объект модуль не содержит объект код, используемый для инициализации этого модуля (поскольку инициализация уже произведена, и он больше не может понадобиться).

source: Attribute assignment updates the module's namespace dictionary, e.g., ``m.x = 1`` is equivalent to ``m.__dict__["x"] = 1``.
ru: Назначение атрибуту, по сути, обновляет словарь области имён модуля, например «``m.x = 1``» эквивалентно «``m.__dict__["x"] = 1``» .

source: Special read-only attribute: :attr:`__dict__` is the module's namespace as a dictionary object.
ru: Специальный атрибут только для чтения : «:attr:`__dict__`» - область имён модуля, в виде объекта словарь.

source: Predefined (writable) attributes: :attr:`__name__` is the module's name; :attr:`__doc__` is the module's documentation string, or ``None`` if unavailable; :attr:`__file__` is the pathname of the file from which the module was loaded, if it was loaded from a file. The :attr:`__file__` attribute is not present for C modules that are statically linked into the interpreter; for extension modules loaded dynamically from a shared library, it is the pathname of the shared library file.
ru: Предопределённые изменяемые атрибуты : «:attr:`__name__`» - имя данного модуля; «:attr:`__doc__`» - строка описания данного модуля, или иначе значение «:const:`None`» ; «:attr:`__file__`» - путь файла, из которого загружен данный модуль, если он был загружен из файла. Атрибут «:attr:`__file__`» отсутствует в модулях на “C” , которые статически прилинкованы к интерпретатору; для модулей расширений, подгруженных динамически из общих библиотек - он является путём файла соответствующей общей библиотеки.

source: Custom class types are typically created by class definitions (see section :ref:`class`). A class has a namespace implemented by a dictionary object. Class attribute references are translated to lookups in this dictionary, e.g., ``C.x`` is translated to ``C.__dict__["x"]`` (although there are a number of hooks which allow for other means of locating attributes). When the attribute name is not found there, the attribute search continues in the base classes. This search of the base classes uses the C3 method resolution order which behaves correctly even in the presence of 'diamond' inheritance structures where there are multiple inheritance paths leading back to a common ancestor. Additional details on the C3 MRO used by Python can be found in the documentation accompanying the 2.3 release at http://www.python.org/download/releases/2.3/mro/.
ru: Типы определяемых классов, как правило, создаются определением класса (смотрите раздел “Определения классов” ). Класс имеет область имён реализованую в виде объекта словарь. Указания атрибутов класса преобразуются в поиск в этом словаре, например, «``C.x``» заменяется на «``C.__dict__["x"]``» (хотя есть ряд трюков, которые позволяют разместить атрибуты другим путём). Когда имя данного атрибута там не найдено, поиск атрибута продолжается в базовых классах. Такой поиск базовых классов использует порядок разрешения метода “C3”, который ведет себя правильно, даже в случае структуры наследования типа “diamond” , тоесть, где есть несколько путей наследования сходящихся обратно к одному общему предку. Дополнительную информацию об “C3 MRO” можно найти в документации, сопровождающей релиз 2.3 по адресу : http://www.python.org/download/releases/2.3/mro/ .

source: When a class attribute reference (for class :class:`C`, say) would yield a class method object, it is transformed into an instance method object whose :attr:`__self__` attributes is :class:`C`. When it would yield a static method object, it is transformed into the object wrapped by the static method object. See section :ref:`descriptors` for another way in which attributes retrieved from a class may differ from those actually contained in its :attr:`__dict__`.
ru: Когда указание на атрибут класса (назовём класс “C”) должно давать объект - метод класса – он преобразуется в объект - метод экземпляра, чей атрибут «:attr:`__self__`» имеет значение «``C``» . А когда это указание должно давать объект - статический метод – он преобразуется в тот же объект “обёрнутый” объектом - статическим методом. Другие варианты, того как атрибуты, получаемые из класса, могут отличаться от реально содержащихся в их атрибуте «:attr:`__dict__`» – смотрите в разделе “Реализация дескрипторов” :ref:`descriptors` .

source: Class attribute assignments update the class's dictionary, never the dictionary of a base class.
ru: Запись значений в атрибуты класса модифицирует словарь этого класса, но ни в коем случае не соответствующий словарь базового класса.

source: A class object can be called (see above) to yield a class instance (see below).
ru: Объект класс может быть вызван (запущен на исполнение), как упомянуто выше, чтобы сгенерировать экземпляр класса (смотрите ниже).

source: Special attributes: :attr:`__name__` is the class name; :attr:`__module__` is the module name in which the class was defined; :attr:`__dict__` is the dictionary containing the class's namespace; :attr:`__bases__` is a tuple (possibly empty or a singleton) containing the base classes, in the order of their occurrence in the base class list; :attr:`__doc__` is the class's documentation string, or None if undefined.
ru: Специальные атрибуты: «:attr:`__name__`» - имя класса; «:attr:`__module__`» - имя модуля, в котором был определен этот класс; «:attr:`__dict__`» - словарь, содержащий область имён этого класса; «:attr:`__bases__`» - кортеж (возможно, пустой или с одним элементом (“singleton”)), содержащий базовые классы, в порядке их появления в списке базовых классов; «:attr:`__doc__`» - строка описания данного класса, или иначе значение «:const:`None`» .

source: A class instance is created by calling a class object (see above). A class instance has a namespace implemented as a dictionary which is the first place in which attribute references are searched. When an attribute is not found there, and the instance's class has an attribute by that name, the search continues with the class attributes. If a class attribute is found that is a user-defined function object, it is transformed into an instance method object whose :attr:`__self__` attribute is the instance. Static method and class method objects are also transformed; see above under "Classes". See section :ref:`descriptors` for another way in which attributes of a class retrieved via its instances may differ from the objects actually stored in the class's :attr:`__dict__`. If no class attribute is found, and the object's class has a :meth:`__getattr__` method, that is called to satisfy the lookup.
ru: Экземпляр класса создается путем вызова объекта класс (см. выше). Экземпляр класса имеет область имён, реализованную в виде словаря, который является первым местом, в котором ищутся атрибуты. Если атрибут здесь не найден, а класс этого экземпляра имеет атрибут с таким именем, поиск продолжается в атрибутах класса. Если становится известно, что некий атрибут класса является объектом функцией пользователя, он преобразуется в объект метод экземпляра, чей атрибут «:attr:`__self__`» является тем экземпляром. Статические методы и объекты методы класса также преобразуются, см. выше в разделе “Классы” . Смотрите также в разделе “Реализация дескрипторов” :ref:`descriptors` другой вариант того как атрибуты класса, полученного через его экземпляры, могут отличаться от объектов, на самом деле хранящихся в атрибуте «:attr:`__dict__`» этого класса. Если атрибут класса не найден, но класс этого объекта имеет метод «:meth:`__getattr__`» , то этот метод вызывается и возвращаемое им значение возвращается в качестве значения искомого атрибута.

source: Attribute assignments and deletions update the instance's dictionary, never a class's dictionary. If the class has a :meth:`__setattr__` or :meth:`__delattr__` method, this is called instead of updating the instance dictionary directly.
ru: Запись значения в атрибуты и их удаление обновляют словарь экземпляра. Если класс имеет методы «:meth:`__setattr__`» или «:meth:`__delattr__`» , то вызываются они - вместо обновления словаря экземпляра напрямую.

source: Class instances can pretend to be numbers, sequences, or mappings if they have methods with certain special names. See section :ref:`specialnames`.
ru: Экземпляры класса могут вести себя как числа, последовательности или отображения, если у них есть методы с определёнными специальными именами. См. раздел “Имена специальных методов” :ref:`specialnames` .

source: Special attributes: :attr:`__dict__` is the attribute dictionary; :attr:`__class__` is the instance's class.
ru: Специальные атрибуты: «:attr:`__dict__`» - словарь атрибутов; «:attr:`__class__`» - класс данного экземпляра.

source: A file object represents an open file. Various shortcuts are available to create file objects: the :func:`open` built-in function, and also :func:`os.popen`, :func:`os.fdopen`, and the :meth:`makefile` method of socket objects (and perhaps by other functions or methods provided by extension modules).
ru: Файловый объект представляет собой открытый файл. Файловые объекты создаются встроенной функцией «:func:`open`» , а также функциями «:func:`os.popen`» , «:func:`os.fdopen`» , и методом «:meth:`makefile`» объектов сокетов (и, возможно, другими функциями или методами, предоставляемыми модулями расширения ).

source: The objects ``sys.stdin``, ``sys.stdout`` and ``sys.stderr`` are initialized to file objects corresponding to the interpreter's standard input, output and error streams; they are all open in text mode and therefore follow the interface defined by the :class:`io.TextIOBase` abstract class.
ru: Объекты «:obj:`sys.stdin`», «:obj:`sys.stdout`» и «:obj:`sys.stderr`» инициализируются в файловые объекты, соответствующие стандартным потокам ввода, вывода и ошибок интерпретатора. Все они открыты в текстовом режиме, и, таким образом, соответствуют интерфейсу, определённому в абстрактном классе «:class:`io.TextIOBase`» .

source: A few types used internally by the interpreter are exposed to the user. Their definitions may change with future versions of the interpreter, but they are mentioned here for completeness.
ru: Несколько типов, используемых для внутренних целей интерпретатором, предоставяются пользователю. Их определения могут измениться в будущих версиях интерпретатора, но они упоминаются здесь для полноты.
